app/controllers/home_controller.rb

  def index
    if(user_signed_in? && current_user.user_type == "Owner")
      userid = current_user.id
      @saloon = Saloon.where("user_id = #{userid}")
      puts @saloon
      if(@saloon.count == 0)
---
SELECT "saloons".* FROM "saloons" WHERE (user_id = 1)
SELECT COUNT(*) FROM "saloons" WHERE (user_id = 1)