app/controllers/saloons_controller.rb

SELECT "saloons".* FROM "saloons"
---
  def index
  	@saloons=Saloon.all

SELECT "saloons".* FROM "saloons" WHERE "saloons"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
def show
    @saloon = Saloon.find(params[:id])

INSERT INTO "saloons" ("name", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "D"], ["address", "Calicut"], ["user_id", 1], ["created_at", "2020-12-29 13:59:42.235759"], ["updated_at", "2020-12-29 13:59:42.235759"]]
---
  def create
    @saloon = Saloon.new(saloon_params)

    if @saloon.save

SELECT "saloons".* FROM "saloons" WHERE "saloons"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
def edit
    @saloon = Saloon.find(params[:id])

SELECT "saloons".* FROM "saloons" WHERE "saloons"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "saloons" SET "name" = ?, "updated_at" = ? WHERE "saloons"."id" = ?  [["name", "hjn"], ["updated_at", "2020-12-29 14:20:40.737736"], ["id", 4]]
---
def update
    @saloon = Saloon.find(params[:id])

    if @saloon.update(saloon_params)

SELECT "saloons".* FROM "saloons" WHERE "saloons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "saloons" WHERE "saloons"."id" = ?  [["id", 1]]
---
  def destroy
    @saloon = Saloon.find(params[:id])
    @saloon.destroy