app/controllers/services_controller.rb

  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("name", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hair Colour"], ["price", 1000], ["user_id", 1], ["created_at", "2020-12-29 10:24:48.582143"], ["updated_at", "2020-12-29 10:24:48.582143"]]

  def destroy
    @service.destroy
---
DELETE FROM "services" WHERE "services"."id" = ?  [["id", 1]]

  def correct_user_service
    @service = current_user.service.find_by(id: params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."user_id" = ? AND "services"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

    def set_service
      @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]